package day11.변수종류_초기화;




public class 클래스변수 {

	public static void main(String[] args) {
		 
		
		
		/*1.만드는 위치
		    클래스내부
		    static 키워드 사용 

          2. 언제 생성되는가?
             프로그램이 실행되면 메모리에 로드됨 ( 매서드영역 (static 영역)) 
             
          3. 언제 사라지는가?
             프로그램종료되면 사라짐 
             
          4. 용도
             클래스내에서 공유할 목적 
             객체가 공유해야하는 값이 있을 때 
             객체생성과 무관하게 사용할 수 있음
              
          5. 객체를 여러번 생성해도 클래스 변수는 단 한번 생김 
             이유는 객체생성과 무관하다
		*/

	}

}
