package day07;

public class 함수정리 {

	public static void main(String[] args) {
		//함수란? 명령어의 집합(명령어 모음)=>기능에 맞는 명령어를 모아 둔 것
		
		//함수
		//선언부
		//정의부
		
		
		//함수 사용 이유(목적)
		// - 중복코드 제거(유지보수성 좋게 함
		// - 코드 분할 목적
		
		
		//함수 이름: 기능에 맞게 개발자가 부여함(첫글자 소문자 규칙을 가지고있음)
		//매개변수(입력): 입력이 없을 수 있다, 한개 또는 여러개 있을 수 있다
		//반환타입: 함수가 호출되고 실행된 후 반환값에 대한 자료형을 말한다
		
		//반환타입: int, double, char, boolean, String
		//반환값이 없을 경우: 반드시 void를 명시해야한다.
		//주의사항: 함수의 반환은 반드시 한 개여야 한다.
		//여러개를 반환해야 할 때는 배열 또는 객체를 사용한다.
		
		
		//지역변수 => 함수안에서 만들어지는 변수
		//함수 안에서 만들어지는 변수는 그 함수 안에서만 사용가능하다.
		
		
	}
	
	//성적표 출력하기
	public static void printTitle() {//함수 선언부(함수머리)
									 //함수 정의부(함수 몸체)
		
		
		
	}

}
