package day12.상속.다형성;

public class 다형성 {

	public static void main(String[] args) {
		
		
		//다형성
		/*
		 * 1. 상속관계에서 발생한다
		 * 2. 부모의 메서드를 자식이 재정의해야한다
		 * 3. 자식을 부모로 다룰 수 있다(업캐스팅)
		 * 4. 재정의된 메서드는 부모로 다루어도 자식의 메서드가 우선권을 가진다
		 * 
		 * 
		 * 다형성이란
		 * 
		 * */
		// :상속관계에서 자식이 부모의 매서드를 재정의(오버라이딩)함으로써 
		// 부모타입으로 자식 객체의 매서드가 실행되게 할 수 있다. 
				
		// 여러 다른 자식 객체를 같은 부모타입으로 다루었을 때 , 각 객체의 고유한 매서드가 동작하게 할 수 있다 
		// => 메시지(매서드 호출)는 동일하지만 실제 실행되는 내용은 객체에 따라 다르게 동작되는 것을 말한다
		
		
		
		
		
		
	}

}
