package day10.생성자;

public class 생성자 {

	public static void main(String[] args) {
		 
		
		
		// Scanner sc = new Scanner(  System.in );
		
		//캡슐화 도구  : 생성자 
		
		
		//생성자란?  객체가 생성될 때 단 한번 호출되어 객체의 값을 초기화한다 
		//생성자를 하나라도 만들지 않으면 기본생성자(매개변수가 없는 생성자)를 제공한다 
		//생성자 작성 규칙
		//1. 생성자의 이름은 클래스이름과 동일하다 
		//2. 반환타입을 명시하면 안된다 
		//3. 생성자는 매개변수가 다른 여러개의 생성자를 만들 수 있다.
		//4. 생성자를 만들면 기본생성자는 제공되지 않는다
		
		//생성자는 별도로 호출할 수 없다 ( 객체가 생성될 때  new에 의해  단 한 번 호출)
		
		//생성자를 두는 이유?
		//생성된 객체의 데이터가 외부로부터 불필요하게 변경되지 않도록 한다 ( 데이터보호를 할 수 있다)
		
		

	}

}
